Процедура ОбновитьТокены() Экспорт 
	
	АдресРесурса = СтрШаблон("%1/auth/v1/refresh", АдресСервера);
		
	ДанныеJSON = Новый Структура;
	ДанныеJSON.Вставить("RefreshToken", RefreshToken);
	
	ДополнительныеПараметрыЗапроса = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметрыЗапроса.Json = ДанныеJSON;
	
	Попытка
		Ответ = КоннекторHTTP.Post(АдресРесурса,, ДополнительныеПараметрыЗапроса);
	Исключение		
		ВызватьИсключение "Ошибка подключения";
	КонецПопытки;
	
	Если Ответ.КодСостояния > 300 Тогда	
		
		Если Запомнить Тогда
			Константы.RefreshТокен.Установить("");
		КонецЕсли;
		
		AccessToken  = "";
		RefreshToken = "";
		ВремяЖизниТокена = '00010101';
		
		Если Ответ.КодСостояния = 401 Тогда			
			ВызватьИсключение "Токен недействителен";	
		Иначе
			ВызватьИсключение "Что-то пошло не так. Обратитесь в поддержку";
		КонецЕсли;	
	КонецЕсли;;
	
	Попытка		
		ПараметрыПреобразования = Новый Структура;
		ПараметрыПреобразования.Вставить("ПрочитатьВСоответствие", Ложь);	
		
		Данные = КоннекторHTTP.КакJson(Ответ, ПараметрыПреобразования);
	Исключение
		Если Запомнить Тогда
			Константы.RefreshТокен.Установить("");
		КонецЕсли;
		
		AccessToken  = "";
		RefreshToken = "";
		ВремяЖизниТокена = '00010101';
						
		ВызватьИсключение "Ошибка разбора ответа";	
	КонецПопытки;
	
	AccessToken = Данные.accessToken;
	RefreshToken = Данные.refreshToken;
	ВремяЖизниТокена = ТекущаяДатаСеанса() + Данные.expires;
	
	Если Запомнить Тогда
		Константы.RefreshТокен.Установить(RefreshToken);	
	КонецЕсли;	
	
КонецПроцедуры

