
&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	Константы.АдресСервера.Установить(Объект.АдресСервера);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СохранитьНастройкиНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКешируемыеЗначенияНаСервере()

	НаборЗаписей = РегистрыСведений.КешируемыеЗначения.СоздатьНаборЗаписей();
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКешируемыеЗначения(Команда)
	
	ОбновитьКешируемыеЗначенияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопироватьДанныеФормы(Параметры.Объект, ЭтаФорма.Объект);
	Элементы.ОбновитьКешируемыеЗначения.Видимость = ЗначениеЗаполнено(Объект.AccessToken);
	
КонецПроцедуры
